<template>
  <div id="orders">
    <router-view></router-view>
  </div>
</template>

<script>
import OrdersItem from "../../components/profile/Orders-Item";

export default {
  components: {
    OrdersItem
  },
  data() {
    return {
      titles: [
        "شماره سفارش",
        "تاریخ ثبت سفارش",
        "وضعیت سفارش",
        "مبلغ قابل پرداخت",
        "مبلغ کل",
        "وضعیت پرداخت",
        "جزئیات"
      ],
      orders: {
        o2: [
          "0925351531581",
          "02/02/02",
          "تحویل داده شده",
          "1000000000",
          "10000000000",
          "پرداخت شده",
          ""
        ],
        o3: [
          "0925351531581",
          "02/02/02",
          "تحویل داده شده",
          "1000000000",
          "10000000000",
          "پرداخت شده",
          ""
        ],
        o4: [
          "0925351531581",
          "02/02/02",
          "تحویل داده شده",
          "1000000000",
          "10000000000",
          "پرداخت شده",
          ""
        ],
        o5: [
          "0925351531581",
          "02/02/02",
          "تحویل داده شده",
          "1000000000",
          "10000000000",
          "پرداخت شده",
          ""
        ],
        o6: [
          "0925351531581",
          "02/02/02",
          "تحویل داده شده",
          "1000000000",
          "10000000000",
          "پرداخت شده",
          ""
        ],
        o7: [
          "0925351531581",
          "02/02/02",
          "تحویل داده شده",
          "1000000000",
          "10000000000",
          "پرداخت شده",
          ""
        ],
        o8: [
          "0925351531581",
          "02/02/02",
          "تحویل داده شده",
          "1000000000",
          "10000000000",
          "پرداخت شده",
          ""
        ],
        o9: [
          "0925351531581",
          "02/02/02",
          "تحویل داده شده",
          "1000000000",
          "10000000000",
          "پرداخت شده",
          ""
        ],
        o10: [
          "0925351531581",
          "02/02/02",
          "تحویل داده شده",
          "1000000000",
          "10000000000",
          "پرداخت شده",
          ""
        ],
        o11: [
          "0925351531581",
          "02/02/02",
          "تحویل داده شده",
          "1000000000",
          "10000000000",
          "پرداخت شده",
          ""
        ],
        o12: [
          "0925351531581",
          "02/02/02",
          "تحویل داده شده",
          "1000000000",
          "10000000000",
          "پرداخت شده",
          ""
        ],
        o13: [
          "0925351531581",
          "02/02/02",
          "تحویل داده شده",
          "1000000000",
          "10000000000",
          "پرداخت شده",
          ""
        ]
      }
    };
  }
};
</script>

<style scoped>
::-webkit-scrollbar {
  width: 0px;
}
::-webkit-scrollbar-thumb {
  background: rgb(255, 252, 252);
}
::-webkit-scrollbar-track {
  background: rgb(255, 252, 252);
  margin-top: 3px;
}

* {
  font-family: IRANSans;
  background-color: #f7f4f4;
}
#orders {
  margin-top: 1.5em
}
</style>